ErpTest/src/Reports/уатСравнениеПробегаИРасходаГСМПоGPSЗаПериод/уатСравнениеПробегаИРасходаГСМПоGPSЗаПериод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>уатСравнениеПробегаИРасходаГСМПоGPSЗаПериод</name>
</mdclass:Report>

ErpTest/src/AccumulationRegisters/уатВыработкаТС/уатВыработкаТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатВыработкаТС</name>
  <comment>Выработка транспортных средств (уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>CatalogRef.уатВидыПеревозок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Колонна</name>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.уатМаршруты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТС</name>
    <comment>ТС или оборудование</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтроительнаяРабота</name>
    <type>
      <types>CatalogRef.рар_СтроительныеРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СценарийПланирования</name>
    <type>
      <types>CatalogRef.рар_СценарииПланированияПроектовСтроительства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/AccumulationRegisters/уатРасходГСМнаТС/уатРасходГСМнаТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатРасходГСМнаТС</name>
  <comment>(уат)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>РасходПоНорме</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасходПоФакту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Водитель</name>
    <comment>Водитель</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГСМ</name>
    <comment>ГСМ</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Колонна</name>
    <comment>Колонна к которой принадлежит ТС на момент закрытия ПЛ</comment>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <comment>Организация, к которой принадлежит ТС на момент закрытия ПЛ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТС</name>
    <comment>ТС или оборудование</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/InformationRegisters/уатМестоположениеПоGPS/уатМестоположениеПоGPS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатМестоположениеПоGPS</name>
  <comment>История местоположения транспортных средств по данным системы спутникового мониторинга (GPS)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗначениеОдометра</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеСчетчикаМоточасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Лон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПотребленноеТопливо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пункт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Скорость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньТоплива</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеДатчика1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеДатчика2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеДатчика3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеДатчика4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеДатчика5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеДатчика6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТС</name>
    <comment>Транспортное средство</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/уатВидыМоделейТС/уатВидыМоделейТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыМоделейТС</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>Автотранспорт</name>
  </enumValues>
  <enumValues>
    <name>Прицеп</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Reports/уатСравнениеПробегаИРасходаГСМПоGPSЗаПериод/ObjectModule.bsl
Функция СформироватьТаблицуДанных(Знач НастройкиКомпоновки, Знач ДатаС, Знач ДатаПо)
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("ДатаС",  ДатаС);
	мЗапрос.УстановитьПараметр("ДатаПо", ДатаПо);
	
	СтрокаДопУсловий = "";
	СчПараметр = 1;
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл 
		Если ЭлементОтбора.Использование Тогда 
			СтрокаУсловия = Строка(ЭлементОтбора.ЛевоеЗначение);
			
			Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда 
				СтрокаУсловия = СтрокаУсловия + " = &Параметр_" + Формат(СчПараметр, "ЧГ=0");
			ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
				СтрокаУсловия = СтрокаУсловия + " <> &Параметр_" + Формат(СчПараметр, "ЧГ=0");
			ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда
				СтрокаУсловия = СтрокаУсловия + " < &Параметр_" + Формат(СчПараметр, "ЧГ=0");
			ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда
				СтрокаУсловия = СтрокаУсловия + " > &Параметр_" + Формат(СчПараметр, "ЧГ=0");
			ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
				СтрокаУсловия = СтрокаУсловия + " <= &Параметр_" + Формат(СчПараметр, "ЧГ=0");
			ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
				СтрокаУсловия = СтрокаУсловия + " >= &Параметр_" + Формат(СчПараметр, "ЧГ=0");
			ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
				СтрокаУсловия = СтрокаУсловия + " В(&Параметр_" + Формат(СчПараметр, "ЧГ=0") + ")";
			ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				СтрокаУсловия = СтрокаУсловия + " В ИЕРАРХИИ(&Параметр_" + Формат(СчПараметр, "ЧГ=0") + ")";
			ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит Тогда
				СтрокаУсловия = СтрокаУсловия + " ПОДОБНО &Параметр_" + Формат(СчПараметр, "ЧГ=0");
			Иначе 
				Продолжить;
			КонецЕсли;
			
			СтрокаДопУсловий = СтрокаДопУсловий + ?(СтрокаДопУсловий="",""," И ") + СтрокаУсловия;
			
			мЗапрос.УстановитьПараметр("Параметр_" + Формат(СчПараметр, "ЧГ=0"), ЭлементОтбора.ПравоеЗначение);
			
			СчПараметр = СчПараметр + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаДопУсловий = "" Тогда 
		СтрокаДопУсловий = "ИСТИНА";
	КонецЕсли;
	
	ТекстЗапроса_ПЛ =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ДЕНЬ) КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ДЕКАДА) КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ГОД) КАК ПериодГод,
	|	уатВыработкаТСОбороты.ТС КАК ТС,
	|	ВЫБОР
	|		КОГДА уатВыработкаТСОбороты.ТС.уатВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Автотранспорт)
	|			ТОГДА уатВыработкаТСОбороты.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПробегПоПЛ,
	|	уатВыработкаТСОбороты.КоличествоОборот КАК ПробегПоПЛТС,
	|	0 КАК РасходПоПЛ,
	|	0 КАК ПробегПоGPS,
	|	0 КАК РасходПоGPS
	|ИЗ
	|	РегистрНакопления.уатВыработкаТС.Обороты(
	|			&ДатаС,
	|			&ДатаПо,
	|			Запись,
	|			ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ПробегОбщий)
	|				И %ДопУсловия%) КАК уатВыработкаТСОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(уатРасходГСМнаТСОбороты.Период, ДЕНЬ),
	|	НАЧАЛОПЕРИОДА(уатРасходГСМнаТСОбороты.Период, НЕДЕЛЯ),
	|	НАЧАЛОПЕРИОДА(уатРасходГСМнаТСОбороты.Период, ДЕКАДА),
	|	НАЧАЛОПЕРИОДА(уатРасходГСМнаТСОбороты.Период, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(уатРасходГСМнаТСОбороты.Период, КВАРТАЛ),
	|	НАЧАЛОПЕРИОДА(уатРасходГСМнаТСОбороты.Период, ПОЛУГОДИЕ),
	|	НАЧАЛОПЕРИОДА(уатРасходГСМнаТСОбороты.Период, ГОД),
	|	уатРасходГСМнаТСОбороты.ТС,
	|	0,
	|	0,
	|	уатРасходГСМнаТСОбороты.РасходПоФактуОборот,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.уатРасходГСМнаТС.Обороты(&ДатаС, &ДатаПо, Запись, %ДопУсловия%) КАК уатРасходГСМнаТСОбороты";
	
	ТекстЗапроса_ПЛ = СтрЗаменить(ТекстЗапроса_ПЛ, "%ДопУсловия%", СтрокаДопУсловий);
	
	мЗапрос.Текст = ТекстЗапроса_ПЛ;
	
	ТабДанных = мЗапрос.Выполнить().Выгрузить();
	
	ТекстЗапроса_GPS = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(&ДатаС, ДЕНЬ) КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(&ДатаС, НЕДЕЛЯ) КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(&ДатаС, ДЕКАДА) КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(&ДатаС, МЕСЯЦ) КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(&ДатаС, КВАРТАЛ) КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(&ДатаС, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(&ДатаС, ГОД) КАК ПериодГод,
	|	ДанныеПоGPSНаКонец.ТС КАК ТС,
	|	ДанныеПоGPSНаКонец.ЗначениеОдометра - ЕСТЬNULL(ДанныеПоGPSНаНачало.ЗначениеОдометра, 0) КАК ПробегПоGPS,
	|	(ДанныеПоGPSНаКонец.ПотребленноеТопливо - ЕСТЬNULL(ДанныеПоGPSНаНачало.ПотребленноеТопливо, 0)) КАК РасходПоGPS
	|ИЗ
	|	РегистрСведений.уатМестоположениеПоGPS.СрезПоследних(&ДатаПо, %ДопУсловия%) КАК ДанныеПоGPSНаКонец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатМестоположениеПоGPS.СрезПоследних(&ДатаС, %ДопУсловия%) КАК ДанныеПоGPSНаНачало
	|		ПО ДанныеПоGPSНаКонец.ТС = ДанныеПоGPSНаНачало.ТС
	|ГДЕ
	|	НЕ (ДанныеПоGPSНаКонец.ЗначениеОдометра - ЕСТЬNULL(ДанныеПоGPSНаНачало.ЗначениеОдометра, 0) = 0
	|	И ДанныеПоGPSНаКонец.ПотребленноеТопливо - ЕСТЬNULL(ДанныеПоGPSНаНачало.ПотребленноеТопливо, 0) = 0)";
	
	ТекстЗапроса_GPS = СтрЗаменить(ТекстЗапроса_GPS, "%ДопУсловия%", СтрокаДопУсловий);
	
	мЗапрос.Текст = ТекстЗапроса_GPS;
	
	ДатаПо = ДатаПо + 1;
	
	ДатаНачалаСреза = ДатаС;
	флКонец = Ложь;
	Пока Не флКонец Цикл 
		ДатаКонецСреза = ДатаНачалаСреза + 86400;
		Если ДатаКонецСреза >= ДатаПо Тогда 
			ДатаКонецСреза = ДатаПо;
			флКонец = Истина;
		КонецЕсли;
		
		мЗапрос.УстановитьПараметр("ДатаС",  ДатаНачалаСреза);
		мЗапрос.УстановитьПараметр("ДатаПо", ДатаКонецСреза);
		
		мВыборка = мЗапрос.Выполнить().Выбрать();
		Пока мВыборка.Следующий() Цикл 
			НовСтрока = ТабДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, мВыборка);
		КонецЦикла;
		
		ДатаНачалаСреза = ДатаКонецСреза;
	КонецЦикла;
	
	Возврат ТабДанных;
	
КонецФункции // СформироватьТаблицуДанных()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновкиДанных = ЭтотОбъект.СхемаКомпоновкиДанных;
	Настройки = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	ДатаС  = '00010101000000';
	ДатаПо = '39991231235959';
	Для Каждого ТекПараметр Из Настройки.ПараметрыДанных.Элементы Цикл 
		Если ТекПараметр.Использование 
				И ТекПараметр.Параметр = Новый ПараметрКомпоновкиДанных("НачалоПериода") 
				И ТипЗнч(ТекПараметр.Значение) = Тип("СтандартнаяДатаНачала") Тогда 
			ДатаС = НачалоДня(ТекПараметр.Значение.Дата);
		ИначеЕсли ТекПараметр.Использование 
				И ТекПараметр.Параметр = Новый ПараметрКомпоновкиДанных("КонецПериода") 
				И ТипЗнч(ТекПараметр.Значение) = Тип("СтандартнаяДатаНачала") Тогда 
			ДатаПо = КонецДня(ТекПараметр.Значение.Дата);
		КонецЕсли;
	КонецЦикла;
	
	Если ДатаС > ДатаПо Тогда 
		ТекстОшибки = "Дата начала периода не может быть больше даты окончания.";
		Сообщить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТабДанныхДляСравнения", СформироватьТаблицуДанных(Настройки, ДатаС, ДатаПо));
	
	КомпоновщикМакета         = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки           = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	ПроцессорВывода           = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб = Истина;
	
КонецПроцедуры
